## One hot Encoding is used for Nominal data(Nominal data are those data which are not in certain order.Like gender male and female are not in any order.These both are equally equal)

<img src='OneHotEncoding.png' />

#### In above figure there are colors which is nominal value as they are not in any order.Now we have to perform onehotEncoding.In oneHotEncoding,we have to make a column for each class i.e in our case there has to be three column(Red,Blue,Yellow).If there there were 50 classes we have to make 50 columns.In resulting column,each row are represented in threee dimensional array i.e. first row is in form of [1,0,0] second in [1,0,0]third in [0,1,0] and so on

## The resultant column formed in second picture i.e YELLOW,BLUE AND RED are known as Dummy variable.These Dummy variable can lead to multicollinearity issue(We will talk about this later).So to reduce this issue,we have to reduce one column from the resulting table.That is,from total of n column we will be only taking n-1 column

## Also, When we have a category such as "Maruti","Suzuki",'Hyundai','Rolls Royces','Land Rover'.Here "Maruti","Suzuki",'Hyundai' may have larger value each but 'Rolls Royces','Land Rover' may have less value each.So in these scenario where some categories have less value,we can combine those less valued categories into single categories as 'Others' where 'Others' contains the combination of both the 'Rolls Royces' and 'Land Rover'

In [119]:
import pandas as pd
import numpy as np

In [13]:
df = pd.read_csv('cars.csv');

In [15]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [21]:
df.isnull().sum()

brand            0
km_driven        0
fuel             0
owner            0
selling_price    0
dtype: int64

### To get information about how many unique row are there in certain column of dataframe,we have to use:

In [38]:
df['brand'].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [40]:
df['brand'].nunique() #thIS HELP US TO FIND THE NO OF UNIQUE VALUE IN THE COLUMNS

32

In [46]:
df['fuel'].value_counts()

fuel
Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: count, dtype: int64

In [48]:
df['owner'].value_counts()

owner
First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: count, dtype: int64

In [72]:
df.sample(2)

        brand  km_driven    fuel         owner  selling_price
4076  Hyundai      30000  Petrol   First Owner         375000
3021   Maruti     110000  Petrol  Second Owner         120000

# OneHotEncoding using scikit-learn

In [74]:
from sklearn.model_selection import train_test_split
X = df.iloc[:,0:4]
Y= df.iloc[:,-1]

In [76]:
X_train,X_test,Y_train,Y_test = train_test_split(X,
                                                Y,
                                                test_size=0.2,
                                                random_state=0)

In [88]:
X_train

           brand  km_driven    fuel         owner
3042     Hyundai      60000     LPG   First Owner
1520        Tata     150000  Diesel   Third Owner
2611     Hyundai     110000  Diesel  Second Owner
3544    Mahindra      28000  Diesel  Second Owner
4138      Maruti      15000  Petrol   First Owner
...          ...        ...     ...           ...
4931        Tata      70000  Diesel   Third Owner
3264        Ford     100000  Diesel  Second Owner
1653     Hyundai      90000  Petrol  Second Owner
2607  Volkswagen      90000  Diesel   First Owner
2732     Hyundai     110000  Petrol   First Owner

[6502 rows x 4 columns]

In [161]:
from sklearn.preprocessing import OneHotEncoder
oh = OneHotEncoder(drop ='first' ,sparse_output=False,dtype=np.int32)

### drop ='first' will remove the first column from resuting table of any dataframe it is applied to.This is done to minimize multicollinearity issue and sparse_outpu = False will give the output of below cell in the form of array .If we dont specify this then by default it will be providing output in sparse matrix format.And also the output will be in the form of float,so to take it in the form of integer,we specify it as np.int32

In [164]:
X_train_new = oh.fit_transform(X_train[['fuel','owner']])

In [166]:
X_train_new

array([[0, 1, 0, ..., 0, 0, 0],
       [1, 0, 0, ..., 0, 0, 1],
       [1, 0, 0, ..., 1, 0, 0],
       ...,
       [0, 0, 1, ..., 1, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       [0, 0, 1, ..., 0, 0, 0]])

### Now this is in a suitable form for us to analyze

In [168]:
X_test_new = oh.transform(X_test[['fuel','owner']])

In [170]:
h = np.hstack((X_train[['brand','km_driven']].values,X_train_new))

In [172]:
h.shape

(6502, 9)

# Now for the feature such as brand that contains a large number of category,it results in many column.So we handle this type of feature as: